GopalSaraf/Practicals/PSDL/include/proc/pic18f24q10.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F24Q10_INC_
#define _PIC18F24Q10_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18F24Q10
 */

/*
 * Device Registers
 */

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 0E9Bh
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: INT0PPS
#define INT0PPS INT0PPS
INT0PPS                                  equ 0E9Ch
// bitfield definitions
INT0PPS_PIN_POSN                         equ 0000h
INT0PPS_PIN_POSITION                     equ 0000h
INT0PPS_PIN_SIZE                         equ 0003h
INT0PPS_PIN_LENGTH                       equ 0003h
INT0PPS_PIN_MASK                         equ 0007h
INT0PPS_PORT_POSN                        equ 0003h
INT0PPS_PORT_POSITION                    equ 0003h
INT0PPS_PORT_SIZE                        equ 0001h
INT0PPS_PORT_LENGTH                      equ 0001h
INT0PPS_PORT_MASK                        equ 0008h
INT0PPS_INT0PPS0_POSN                    equ 0000h
INT0PPS_INT0PPS0_POSITION                equ 0000h
INT0PPS_INT0PPS0_SIZE                    equ 0001h
INT0PPS_INT0PPS0_LENGTH                  equ 0001h
INT0PPS_INT0PPS0_MASK                    equ 0001h
INT0PPS_INT0PPS1_POSN                    equ 0001h
INT0PPS_INT0PPS1_POSITION                equ 0001h
INT0PPS_INT0PPS1_SIZE                    equ 0001h
INT0PPS_INT0PPS1_LENGTH                  equ 0001h
INT0PPS_INT0PPS1_MASK                    equ 0002h
INT0PPS_INT0PPS2_POSN                    equ 0002h
INT0PPS_INT0PPS2_POSITION                equ 0002h
INT0PPS_INT0PPS2_SIZE                    equ 0001h
INT0PPS_INT0PPS2_LENGTH                  equ 0001h
INT0PPS_INT0PPS2_MASK                    equ 0004h
INT0PPS_INT0PPS3_POSN                    equ 0003h
INT0PPS_INT0PPS3_POSITION                equ 0003h
INT0PPS_INT0PPS3_SIZE                    equ 0001h
INT0PPS_INT0PPS3_LENGTH                  equ 0001h
INT0PPS_INT0PPS3_MASK                    equ 0008h
INT0PPS_INT0PPS_POSN                     equ 0000h
INT0PPS_INT0PPS_POSITION                 equ 0000h
INT0PPS_INT0PPS_SIZE                     equ 0004h
INT0PPS_INT0PPS_LENGTH                   equ 0004h
INT0PPS_INT0PPS_MASK                     equ 000Fh

// Register: INT1PPS
#define INT1PPS INT1PPS
INT1PPS                                  equ 0E9Dh
// bitfield definitions
INT1PPS_PIN_POSN                         equ 0000h
INT1PPS_PIN_POSITION                     equ 0000h
INT1PPS_PIN_SIZE                         equ 0003h
INT1PPS_PIN_LENGTH                       equ 0003h
INT1PPS_PIN_MASK                         equ 0007h
INT1PPS_PORT_POSN                        equ 0003h
INT1PPS_PORT_POSITION                    equ 0003h
INT1PPS_PORT_SIZE                        equ 0001h
INT1PPS_PORT_LENGTH                      equ 0001h
INT1PPS_PORT_MASK                        equ 0008h
INT1PPS_INT1PPS0_POSN                    equ 0000h
INT1PPS_INT1PPS0_POSITION                equ 0000h
INT1PPS_INT1PPS0_SIZE                    equ 0001h
INT1PPS_INT1PPS0_LENGTH                  equ 0001h
INT1PPS_INT1PPS0_MASK                    equ 0001h
INT1PPS_INT1PPS1_POSN                    equ 0001h
INT1PPS_INT1PPS1_POSITION                equ 0001h
INT1PPS_INT1PPS1_SIZE                    equ 0001h
INT1PPS_INT1PPS1_LENGTH                  equ 0001h
INT1PPS_INT1PPS1_MASK                    equ 0002h
INT1PPS_INT1PPS2_POSN                    equ 0002h
INT1PPS_INT1PPS2_POSITION                equ 0002h
INT1PPS_INT1PPS2_SIZE                    equ 0001h
INT1PPS_INT1PPS2_LENGTH                  equ 0001h
INT1PPS_INT1PPS2_MASK                    equ 0004h
INT1PPS_INT1PPS3_POSN                    equ 0003h
INT1PPS_INT1PPS3_POSITION                equ 0003h
INT1PPS_INT1PPS3_SIZE                    equ 0001h
INT1PPS_INT1PPS3_LENGTH                  equ 0001h
INT1PPS_INT1PPS3_MASK                    equ 0008h
INT1PPS_INT1PPS_POSN                     equ 0000h
INT1PPS_INT1PPS_POSITION                 equ 0000h
INT1PPS_INT1PPS_SIZE                     equ 0004h
INT1PPS_INT1PPS_LENGTH                   equ 0004h
INT1PPS_INT1PPS_MASK                     equ 000Fh

// Register: INT2PPS
#define INT2PPS INT2PPS
INT2PPS                                  equ 0E9Eh
// bitfield definitions
INT2PPS_PIN_POSN                         equ 0000h
INT2PPS_PIN_POSITION                     equ 0000h
INT2PPS_PIN_SIZE                         equ 0003h
INT2PPS_PIN_LENGTH                       equ 0003h
INT2PPS_PIN_MASK                         equ 0007h
INT2PPS_PORT_POSN                        equ 0003h
INT2PPS_PORT_POSITION                    equ 0003h
INT2PPS_PORT_SIZE                        equ 0001h
INT2PPS_PORT_LENGTH                      equ 0001h
INT2PPS_PORT_MASK                        equ 0008h
INT2PPS_INT2PPS0_POSN                    equ 0000h
INT2PPS_INT2PPS0_POSITION                equ 0000h
INT2PPS_INT2PPS0_SIZE                    equ 0001h
INT2PPS_INT2PPS0_LENGTH                  equ 0001h
INT2PPS_INT2PPS0_MASK                    equ 0001h
INT2PPS_INT2PPS1_POSN                    equ 0001h
INT2PPS_INT2PPS1_POSITION                equ 0001h
INT2PPS_INT2PPS1_SIZE                    equ 0001h
INT2PPS_INT2PPS1_LENGTH                  equ 0001h
INT2PPS_INT2PPS1_MASK                    equ 0002h
INT2PPS_INT2PPS2_POSN                    equ 0002h
INT2PPS_INT2PPS2_POSITION                equ 0002h
INT2PPS_INT2PPS2_SIZE                    equ 0001h
INT2PPS_INT2PPS2_LENGTH                  equ 0001h
INT2PPS_INT2PPS2_MASK                    equ 0004h
INT2PPS_INT2PPS3_POSN                    equ 0003h
INT2PPS_INT2PPS3_POSITION                equ 0003h
INT2PPS_INT2PPS3_SIZE                    equ 0001h
INT2PPS_INT2PPS3_LENGTH                  equ 0001h
INT2PPS_INT2PPS3_MASK                    equ 0008h
INT2PPS_INT2PPS_POSN                     equ 0000h
INT2PPS_INT2PPS_POSITION                 equ 0000h
INT2PPS_INT2PPS_SIZE                     equ 0004h
INT2PPS_INT2PPS_LENGTH                   equ 0004h
INT2PPS_INT2PPS_MASK                     equ 000Fh

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 0E9Fh
// bitfield definitions
T0CKIPPS_PIN_POSN                        equ 0000h
T0CKIPPS_PIN_POSITION                    equ 0000h
T0CKIPPS_PIN_SIZE                        equ 0003h
T0CKIPPS_PIN_LENGTH                      equ 0003h
T0CKIPPS_PIN_MASK                        equ 0007h
T0CKIPPS_PORT_POSN                       equ 0003h
T0CKIPPS_PORT_POSITION                   equ 0003h
T0CKIPPS_PORT_SIZE                       equ 0001h
T0CKIPPS_PORT_LENGTH                     equ 0001h
T0CKIPPS_PORT_MASK                       equ 0008h
T0CKIPPS_T0CKIPPS0_POSN                  equ 0000h
T0CKIPPS_T0CKIPPS0_POSITION              equ 0000h
T0CKIPPS_T0CKIPPS0_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS0_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS0_MASK                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSN                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSITION              equ 0001h
T0CKIPPS_T0CKIPPS1_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS1_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS1_MASK                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSN                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSITION              equ 0002h
T0CKIPPS_T0CKIPPS2_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS2_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS2_MASK                  equ 0004h
T0CKIPPS_T0CKIPPS3_POSN                  equ 0003h
T0CKIPPS_T0CKIPPS3_POSITION              equ 0003h
T0CKIPPS_T0CKIPPS3_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS3_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS3_MASK                  equ 0008h
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0004h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0004h
T0CKIPPS_T0CKIPPS_MASK                   equ 000Fh

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 0EA0h
// bitfield definitions
T1CKIPPS_PIN_POSN                        equ 0000h
T1CKIPPS_PIN_POSITION                    equ 0000h
T1CKIPPS_PIN_SIZE                        equ 0003h
T1CKIPPS_PIN_LENGTH                      equ 0003h
T1CKIPPS_PIN_MASK                        equ 0007h
T1CKIPPS_PORT_POSN                       equ 0003h
T1CKIPPS_PORT_POSITION                   equ 0003h
T1CKIPPS_PORT_SIZE                       equ 0002h
T1CKIPPS_PORT_LENGTH                     equ 0002h
T1CKIPPS_PORT_MASK                       equ 0018h
T1CKIPPS_T1CKIPPS0_POSN                  equ 0000h
T1CKIPPS_T1CKIPPS0_POSITION              equ 0000h
T1CKIPPS_T1CKIPPS0_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS0_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS0_MASK                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSN                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSITION              equ 0001h
T1CKIPPS_T1CKIPPS1_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS1_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS1_MASK                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSN                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSITION              equ 0002h
T1CKIPPS_T1CKIPPS2_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS2_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS2_MASK                  equ 0004h
T1CKIPPS_T1CKIPPS3_POSN                  equ 0003h
T1CKIPPS_T1CKIPPS3_POSITION              equ 0003h
T1CKIPPS_T1CKIPPS3_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS3_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS3_MASK                  equ 0008h
T1CKIPPS_T1CKIPPS4_POSN                  equ 0004h
T1CKIPPS_T1CKIPPS4_POSITION              equ 0004h
T1CKIPPS_T1CKIPPS4_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS4_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS4_MASK                  equ 0010h
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0005h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0005h
T1CKIPPS_T1CKIPPS_MASK                   equ 001Fh

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 0EA1h
// bitfield definitions
T1GPPS_PIN_POSN                          equ 0000h
T1GPPS_PIN_POSITION                      equ 0000h
T1GPPS_PIN_SIZE                          equ 0003h
T1GPPS_PIN_LENGTH                        equ 0003h
T1GPPS_PIN_MASK                          equ 0007h
T1GPPS_PORT_POSN                         equ 0003h
T1GPPS_PORT_POSITION                     equ 0003h
T1GPPS_PORT_SIZE                         equ 0002h
T1GPPS_PORT_LENGTH                       equ 0002h
T1GPPS_PORT_MASK                         equ 0018h
T1GPPS_T1GPPS0_POSN                      equ 0000h
T1GPPS_T1GPPS0_POSITION                  equ 0000h
T1GPPS_T1GPPS0_SIZE                      equ 0001h
T1GPPS_T1GPPS0_LENGTH                    equ 0001h
T1GPPS_T1GPPS0_MASK                      equ 0001h
T1GPPS_T1GPPS1_POSN                      equ 0001h
T1GPPS_T1GPPS1_POSITION                  equ 0001h
T1GPPS_T1GPPS1_SIZE                      equ 0001h
T1GPPS_T1GPPS1_LENGTH                    equ 0001h
T1GPPS_T1GPPS1_MASK                      equ 0002h
T1GPPS_T1GPPS2_POSN                      equ 0002h
T1GPPS_T1GPPS2_POSITION                  equ 0002h
T1GPPS_T1GPPS2_SIZE                      equ 0001h
T1GPPS_T1GPPS2_LENGTH                    equ 0001h
T1GPPS_T1GPPS2_MASK                      equ 0004h
T1GPPS_T1GPPS3_POSN                      equ 0003h
T1GPPS_T1GPPS3_POSITION                  equ 0003h
T1GPPS_T1GPPS3_SIZE                      equ 0001h
T1GPPS_T1GPPS3_LENGTH                    equ 0001h
T1GPPS_T1GPPS3_MASK                      equ 0008h
T1GPPS_T1GPPS4_POSN                      equ 0004h
T1GPPS_T1GPPS4_POSITION                  equ 0004h
T1GPPS_T1GPPS4_SIZE                      equ 0001h
T1GPPS_T1GPPS4_LENGTH                    equ 0001h
T1GPPS_T1GPPS4_MASK                      equ 0010h
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0005h
T1GPPS_T1GPPS_LENGTH                     equ 0005h
T1GPPS_T1GPPS_MASK                       equ 001Fh

