GopalSaraf/Practicals/PSDL/include/proc/pic18f24q10.inc
// Register: IPR4
#define IPR4 IPR4
IPR4                                     equ 0EB9h
// bitfield definitions
IPR4_TMR1IP_POSN                         equ 0000h
IPR4_TMR1IP_POSITION                     equ 0000h
IPR4_TMR1IP_SIZE                         equ 0001h
IPR4_TMR1IP_LENGTH                       equ 0001h
IPR4_TMR1IP_MASK                         equ 0001h
IPR4_TMR2IP_POSN                         equ 0001h
IPR4_TMR2IP_POSITION                     equ 0001h
IPR4_TMR2IP_SIZE                         equ 0001h
IPR4_TMR2IP_LENGTH                       equ 0001h
IPR4_TMR2IP_MASK                         equ 0002h
IPR4_TMR3IP_POSN                         equ 0002h
IPR4_TMR3IP_POSITION                     equ 0002h
IPR4_TMR3IP_SIZE                         equ 0001h
IPR4_TMR3IP_LENGTH                       equ 0001h
IPR4_TMR3IP_MASK                         equ 0004h
IPR4_TMR4IP_POSN                         equ 0003h
IPR4_TMR4IP_POSITION                     equ 0003h
IPR4_TMR4IP_SIZE                         equ 0001h
IPR4_TMR4IP_LENGTH                       equ 0001h
IPR4_TMR4IP_MASK                         equ 0008h
IPR4_TMR5IP_POSN                         equ 0004h
IPR4_TMR5IP_POSITION                     equ 0004h
IPR4_TMR5IP_SIZE                         equ 0001h
IPR4_TMR5IP_LENGTH                       equ 0001h
IPR4_TMR5IP_MASK                         equ 0010h
IPR4_TMR6IP_POSN                         equ 0005h
IPR4_TMR6IP_POSITION                     equ 0005h
IPR4_TMR6IP_SIZE                         equ 0001h
IPR4_TMR6IP_LENGTH                       equ 0001h
IPR4_TMR6IP_MASK                         equ 0020h
IPR4_CCIP3IP_POSN                        equ 0000h
IPR4_CCIP3IP_POSITION                    equ 0000h
IPR4_CCIP3IP_SIZE                        equ 0001h
IPR4_CCIP3IP_LENGTH                      equ 0001h
IPR4_CCIP3IP_MASK                        equ 0001h

// Register: IPR5
#define IPR5 IPR5
IPR5                                     equ 0EBAh
// bitfield definitions
IPR5_TMR1GIP_POSN                        equ 0000h
IPR5_TMR1GIP_POSITION                    equ 0000h
IPR5_TMR1GIP_SIZE                        equ 0001h
IPR5_TMR1GIP_LENGTH                      equ 0001h
IPR5_TMR1GIP_MASK                        equ 0001h
IPR5_TMR3GIP_POSN                        equ 0001h
IPR5_TMR3GIP_POSITION                    equ 0001h
IPR5_TMR3GIP_SIZE                        equ 0001h
IPR5_TMR3GIP_LENGTH                      equ 0001h
IPR5_TMR3GIP_MASK                        equ 0002h
IPR5_TMR5GIP_POSN                        equ 0002h
IPR5_TMR5GIP_POSITION                    equ 0002h
IPR5_TMR5GIP_SIZE                        equ 0001h
IPR5_TMR5GIP_LENGTH                      equ 0001h
IPR5_TMR5GIP_MASK                        equ 0004h
IPR5_CCH05_POSN                          equ 0000h
IPR5_CCH05_POSITION                      equ 0000h
IPR5_CCH05_SIZE                          equ 0001h
IPR5_CCH05_LENGTH                        equ 0001h
IPR5_CCH05_MASK                          equ 0001h
IPR5_CCH15_POSN                          equ 0001h
IPR5_CCH15_POSITION                      equ 0001h
IPR5_CCH15_SIZE                          equ 0001h
IPR5_CCH15_LENGTH                        equ 0001h
IPR5_CCH15_MASK                          equ 0002h

// Register: IPR6
#define IPR6 IPR6
IPR6                                     equ 0EBBh
// bitfield definitions
IPR6_CCP1IP_POSN                         equ 0000h
IPR6_CCP1IP_POSITION                     equ 0000h
IPR6_CCP1IP_SIZE                         equ 0001h
IPR6_CCP1IP_LENGTH                       equ 0001h
IPR6_CCP1IP_MASK                         equ 0001h
IPR6_CCP2IP_POSN                         equ 0001h
IPR6_CCP2IP_POSITION                     equ 0001h
IPR6_CCP2IP_SIZE                         equ 0001h
IPR6_CCP2IP_LENGTH                       equ 0001h
IPR6_CCP2IP_MASK                         equ 0002h

// Register: IPR7
#define IPR7 IPR7
IPR7                                     equ 0EBCh
// bitfield definitions
IPR7_CWGIP_POSN                          equ 0000h
IPR7_CWGIP_POSITION                      equ 0000h
IPR7_CWGIP_SIZE                          equ 0001h
IPR7_CWGIP_LENGTH                        equ 0001h
IPR7_CWGIP_MASK                          equ 0001h
IPR7_NVMIP_POSN                          equ 0005h
IPR7_NVMIP_POSITION                      equ 0005h
IPR7_NVMIP_SIZE                          equ 0001h
IPR7_NVMIP_LENGTH                        equ 0001h
IPR7_NVMIP_MASK                          equ 0020h
IPR7_CRCIP_POSN                          equ 0006h
IPR7_CRCIP_POSITION                      equ 0006h
IPR7_CRCIP_SIZE                          equ 0001h
IPR7_CRCIP_LENGTH                        equ 0001h
IPR7_CRCIP_MASK                          equ 0040h
IPR7_SCANIP_POSN                         equ 0007h
IPR7_SCANIP_POSITION                     equ 0007h
IPR7_SCANIP_SIZE                         equ 0001h
IPR7_SCANIP_LENGTH                       equ 0001h
IPR7_SCANIP_MASK                         equ 0080h
IPR7_CWG1IP_POSN                         equ 0000h
IPR7_CWG1IP_POSITION                     equ 0000h
IPR7_CWG1IP_SIZE                         equ 0001h
IPR7_CWG1IP_LENGTH                       equ 0001h
IPR7_CWG1IP_MASK                         equ 0001h

// Register: PIE0
#define PIE0 PIE0
PIE0                                     equ 0EBDh
// bitfield definitions
PIE0_INT0IE_POSN                         equ 0000h
PIE0_INT0IE_POSITION                     equ 0000h
PIE0_INT0IE_SIZE                         equ 0001h
PIE0_INT0IE_LENGTH                       equ 0001h
PIE0_INT0IE_MASK                         equ 0001h
PIE0_INT1IE_POSN                         equ 0001h
PIE0_INT1IE_POSITION                     equ 0001h
PIE0_INT1IE_SIZE                         equ 0001h
PIE0_INT1IE_LENGTH                       equ 0001h
PIE0_INT1IE_MASK                         equ 0002h
PIE0_INT2IE_POSN                         equ 0002h
PIE0_INT2IE_POSITION                     equ 0002h
PIE0_INT2IE_SIZE                         equ 0001h
PIE0_INT2IE_LENGTH                       equ 0001h
PIE0_INT2IE_MASK                         equ 0004h
PIE0_IOCIE_POSN                          equ 0004h
PIE0_IOCIE_POSITION                      equ 0004h
PIE0_IOCIE_SIZE                          equ 0001h
PIE0_IOCIE_LENGTH                        equ 0001h
PIE0_IOCIE_MASK                          equ 0010h
PIE0_TMR0IE_POSN                         equ 0005h
PIE0_TMR0IE_POSITION                     equ 0005h
PIE0_TMR0IE_SIZE                         equ 0001h
PIE0_TMR0IE_LENGTH                       equ 0001h
PIE0_TMR0IE_MASK                         equ 0020h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 0EBEh
// bitfield definitions
PIE1_ADIE_POSN                           equ 0000h
PIE1_ADIE_POSITION                       equ 0000h
PIE1_ADIE_SIZE                           equ 0001h
PIE1_ADIE_LENGTH                         equ 0001h
PIE1_ADIE_MASK                           equ 0001h
PIE1_ADTIE_POSN                          equ 0001h
PIE1_ADTIE_POSITION                      equ 0001h
PIE1_ADTIE_SIZE                          equ 0001h
PIE1_ADTIE_LENGTH                        equ 0001h
PIE1_ADTIE_MASK                          equ 0002h
PIE1_CSWIE_POSN                          equ 0006h
PIE1_CSWIE_POSITION                      equ 0006h
PIE1_CSWIE_SIZE                          equ 0001h
PIE1_CSWIE_LENGTH                        equ 0001h
PIE1_CSWIE_MASK                          equ 0040h
PIE1_OSCFIE_POSN                         equ 0007h
PIE1_OSCFIE_POSITION                     equ 0007h
PIE1_OSCFIE_SIZE                         equ 0001h
PIE1_OSCFIE_LENGTH                       equ 0001h
PIE1_OSCFIE_MASK                         equ 0080h
PIE1_PSPIE_POSN                          equ 0007h
PIE1_PSPIE_POSITION                      equ 0007h
PIE1_PSPIE_SIZE                          equ 0001h
PIE1_PSPIE_LENGTH                        equ 0001h
PIE1_PSPIE_MASK                          equ 0080h

// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 0EBFh
// bitfield definitions
PIE2_C1IE_POSN                           equ 0000h
PIE2_C1IE_POSITION                       equ 0000h
PIE2_C1IE_SIZE                           equ 0001h
PIE2_C1IE_LENGTH                         equ 0001h
PIE2_C1IE_MASK                           equ 0001h
PIE2_C2IE_POSN                           equ 0001h
PIE2_C2IE_POSITION                       equ 0001h
PIE2_C2IE_SIZE                           equ 0001h
PIE2_C2IE_LENGTH                         equ 0001h
PIE2_C2IE_MASK                           equ 0002h
PIE2_ZCDIE_POSN                          equ 0006h
PIE2_ZCDIE_POSITION                      equ 0006h
PIE2_ZCDIE_SIZE                          equ 0001h
PIE2_ZCDIE_LENGTH                        equ 0001h
PIE2_ZCDIE_MASK                          equ 0040h
PIE2_HLVDIE_POSN                         equ 0007h
PIE2_HLVDIE_POSITION                     equ 0007h
PIE2_HLVDIE_SIZE                         equ 0001h
PIE2_HLVDIE_LENGTH                       equ 0001h
PIE2_HLVDIE_MASK                         equ 0080h
PIE2_CMIE_POSN                           equ 0006h
PIE2_CMIE_POSITION                       equ 0006h
PIE2_CMIE_SIZE                           equ 0001h
PIE2_CMIE_LENGTH                         equ 0001h
PIE2_CMIE_MASK                           equ 0040h

// Register: PIE3
#define PIE3 PIE3
PIE3                                     equ 0EC0h
// bitfield definitions
PIE3_SSPIE_POSN                          equ 0000h
PIE3_SSPIE_POSITION                      equ 0000h
PIE3_SSPIE_SIZE                          equ 0001h
PIE3_SSPIE_LENGTH                        equ 0001h
PIE3_SSPIE_MASK                          equ 0001h
PIE3_BCLIE_POSN                          equ 0001h
PIE3_BCLIE_POSITION                      equ 0001h
PIE3_BCLIE_SIZE                          equ 0001h
PIE3_BCLIE_LENGTH                        equ 0001h
PIE3_BCLIE_MASK                          equ 0002h
PIE3_TXIE_POSN                           equ 0004h
PIE3_TXIE_POSITION                       equ 0004h
PIE3_TXIE_SIZE                           equ 0001h
PIE3_TXIE_LENGTH                         equ 0001h
PIE3_TXIE_MASK                           equ 0010h
PIE3_RCIE_POSN                           equ 0005h
PIE3_RCIE_POSITION                       equ 0005h
PIE3_RCIE_SIZE                           equ 0001h
PIE3_RCIE_LENGTH                         equ 0001h
PIE3_RCIE_MASK                           equ 0020h
PIE3_SSP1IE_POSN                         equ 0000h
PIE3_SSP1IE_POSITION                     equ 0000h
PIE3_SSP1IE_SIZE                         equ 0001h
PIE3_SSP1IE_LENGTH                       equ 0001h
PIE3_SSP1IE_MASK                         equ 0001h
PIE3_BCL1IE_POSN                         equ 0001h
PIE3_BCL1IE_POSITION                     equ 0001h
PIE3_BCL1IE_SIZE                         equ 0001h
PIE3_BCL1IE_LENGTH                       equ 0001h
PIE3_BCL1IE_MASK                         equ 0002h
PIE3_TX1IE_POSN                          equ 0004h
PIE3_TX1IE_POSITION                      equ 0004h
PIE3_TX1IE_SIZE                          equ 0001h
PIE3_TX1IE_LENGTH                        equ 0001h
PIE3_TX1IE_MASK                          equ 0010h
PIE3_RC1IE_POSN                          equ 0005h
PIE3_RC1IE_POSITION                      equ 0005h
PIE3_RC1IE_SIZE                          equ 0001h
PIE3_RC1IE_LENGTH                        equ 0001h
PIE3_RC1IE_MASK                          equ 0020h
PIE3_RXB0IE_POSN                         equ 0000h
PIE3_RXB0IE_POSITION                     equ 0000h
PIE3_RXB0IE_SIZE                         equ 0001h
PIE3_RXB0IE_LENGTH                       equ 0001h
PIE3_RXB0IE_MASK                         equ 0001h
PIE3_RXB1IE_POSN                         equ 0001h
PIE3_RXB1IE_POSITION                     equ 0001h
PIE3_RXB1IE_SIZE                         equ 0001h
PIE3_RXB1IE_LENGTH                       equ 0001h
PIE3_RXB1IE_MASK                         equ 0002h
PIE3_RXBNIE_POSN                         equ 0001h
PIE3_RXBNIE_POSITION                     equ 0001h
PIE3_RXBNIE_SIZE                         equ 0001h
PIE3_RXBNIE_LENGTH                       equ 0001h
PIE3_RXBNIE_MASK                         equ 0002h
PIE3_TXB2IE_POSN                         equ 0004h
PIE3_TXB2IE_POSITION                     equ 0004h
PIE3_TXB2IE_SIZE                         equ 0001h
PIE3_TXB2IE_LENGTH                       equ 0001h
PIE3_TXB2IE_MASK                         equ 0010h
PIE3_TXBNIE_POSN                         equ 0004h
PIE3_TXBNIE_POSITION                     equ 0004h
PIE3_TXBNIE_SIZE                         equ 0001h
PIE3_TXBNIE_LENGTH                       equ 0001h
PIE3_TXBNIE_MASK                         equ 0010h

